In [1]:
# Dependencies and Setup
import matplotlib.pyplot as plt
import matplotlib.mlab as mlab 
import pandas as pd
import scipy.stats as st
import numpy as np
import seaborn as sns
import sqlalchemy

# Import key
from config import key

# SQL database into Pandas

In [6]:
# Making the connection to PostgreSQL
from sqlalchemy import create_engine
engine = create_engine(key)
connection = engine.connect()
print(engine)

Engine(postgresql://postgres:***@localhost:5432/sql_challenge_db)

In [13]:
# Histogram to visualize the most common salary ranges for employees
employees = pd.read_sql_table('Employees', engine)
employees

,empl_no,empl_title_id,birth_date,first_name,last_name,sex,hire_date
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18
...,...,...,...,...,...,...,...
300019,464231,s0001,1958-08-14,Constantino,Eastman,M,1988-10-28
300020,255832,e0002,1955-05-08,Yuping,Dayang,F,1995-02-26
300021,76671,s0001,1959-06-09,Ortrud,Plessier,M,1988-02-24
300022,264920,s0001,1959-09-22,Percy,Samarati,F,1994-09-08
300023,464503,s0002,1964-05-31,Arvind,Slobodova,M,1987-11-23

In [14]:
salary = pd.read_sql_table('Salaries', engine)
salary

            id  empl_no  salary
0            1    10001   60117
1            2    10002   65828
2            3    10003   40006
3            4    10004   40054
4            5    10005   78228
...        ...      ...     ...
300019  300020   499995   40000
300020  300021   499996   58058
300021  300022   499997   49597
300022  300023   499998   40000
300023  300024   499999   63707

[300024 rows x 3 columns]

In [15]:
merge = pd.merge(employees, salary, on = 'empl_no')
merge

,empl_no,empl_title_id,birth_date,first_name,last_name,sex,hire_date,id,salary
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,273327,40000
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,275078,53422
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,47444,48973
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,221811,40000
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,182263,40000
...,...,...,...,...,...,...,...,...,...
300019,464231,s0001,1958-08-14,Constantino,Eastman,M,1988-10-28,264256,69696
300020,255832,e0002,1955-05-08,Yuping,Dayang,F,1995-02-26,155857,75355
300021,76671,s0001,1959-06-09,Ortrud,Plessier,M,1988-02-24,66671,61886
300022,264920,s0001,1959-09-22,Percy,Samarati,F,1994-09-08,164945,62772
300023,464503,s0002,1964-05-31,Arvind,Slobodova,M,1987-11-23,264528,41708

In [ ]:
bins=[40000,60000,80000,90000,80000,90000,100000,110000,120000]

In [9]:
# Bar chart of average salary by title.

In [ ]:
# Search for Employee 499942